#+TITLE: Emacs
#+STARTUP: content
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el

My new configuration file mainly based up: [[https://luca.cambiaghi.me/vanilla-emacs/readme.html#h:D9ED3ADB-810A-4A1C-A1D3-5397874AFAC7][Luca]]

** mu4e
[[http://www.djcbsoftware.nl/code/mu/mu4e.html][mu4e]] is the best mail interface I've ever used because it's fast and makes it really easy to power through a huge e-mail backlog.  Love the ability to capture links to emails with org-mode too.

Useful mu4e manual pages:

- [[https://www.djcbsoftware.nl/code/mu/mu4e/MSGV-Keybindings.html#MSGV-Keybindings][Key bindings]]
- [[https://www.djcbsoftware.nl/code/mu/mu4e/Org_002dmode-links.html#Org_002dmode-links][org-mode integration]]

#+begin_src emacs-lisp

  ;; Doom Emacs does not find mu4e, so we need to add
  ;; the following snippet for it to work
  (add-to-list 'load-path "/etc/mu4e")

  (use-package mu4e
    :straight (:type built-in)
    :defer 20 ; Wait until 20 seconds after startup
    :config

    ;; Load org-mode integration
    (require 'org-mu4e)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")

    ;; Use Ivy for mu4e completions (maildir folders, etc)
    (setq mu4e-completing-read-function #'ivy-completing-read)

    ;; Make sure that moving a message (like to Trash) causes the
    ;; message to get a new file name.  This helps to avoid the
    ;; dreaded "UID is N beyond highest assigned" error.
    ;; See this link for more info: https://stackoverflow.com/a/43461973
    (setq mu4e-change-filenames-when-moving t)

    ;; Set up contexts for email accounts
    (setq mu4e-contexts
          `(,(make-mu4e-context
              :name "Mail"
              :match-func (lambda (msg) (when msg
                                          (string-prefix-p "/Mail" (mu4e-message-field msg :maildir))))
              :vars '(
                      (user-full-name . "Mark Broeders")
                      (user-mail-address . "mail@markbroeders.nl")
                      (mu4e-sent-folder . "/mail/Sent")
                      (mu4e-trash-folder . "/mail/Trash")
                      (mu4e-drafts-folder . "/mail/drafts")
                      (mu4e-refile-folder . "/mail/Archive")
                      (mu4e-sent-messages-behavior . sent)
                      ))))
    (setq mu4e-context-policy 'pick-first)

    ;; Prevent mu4e from permanently deleting trashed items
    ;; This snippet was taken from the following article:
    ;; http://cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and-/
    (defun remove-nth-element (nth list)
      (if (zerop nth) (cdr list)
        (let ((last (nthcdr (1- nth) list)))
          (setcdr last (cddr last))
          list)))
    (setq mu4e-marks (remove-nth-element 5 mu4e-marks))
    (add-to-list 'mu4e-marks
                 '(trash
                   :char ("d" . "▼")
                   :prompt "dtrash"
                   :dyn-target (lambda (target msg) (mu4e-get-trash-folder msg))
                   :action (lambda (docid msg target)
                             (mu4e~proc-move docid
                                             (mu4e~mark-check-target target) "-N"))))

    ;; Display options
    (setq mu4e-view-show-images t)
    (setq mu4e-view-show-addresses 't)

    ;; Composing mail
    (setq mu4e-compose-dont-reply-to-self t)

    ;; Use msmtp for sending e-mail
    (setq sendmail-program "msmtp"
          sendmail-function 'smtpmail-send-it
          message-sendmail-f-is-evil t
          message-sendmail-extra-arguments '("--read-envelope-from")
          message-send-mail-function 'message-send-mail-with-sendmail)

    ;; (See the documentation for `mu4e-sent-messages-behavior' if you have
    ;; additional non-Gmail addresses and want assign them different
    ;; behavior.)

    ;; setup some handy shortcuts
    ;; you can quickly switch to your Inbox -- press ``ji''
    ;; then, when you want archive some messages, move them to
    ;; the 'All Mail' folder by pressing ``ma''.
    (setq mu4e-maildir-shortcuts
          '(("/mail/inbox"        . ?i)
            ("/mail/Sent"         . ?s)
            ("/inbox/inbox"       . ?c)
            ("/lorentzlaan/inbox" . ?l)
            ("/mail/Trash"        . ?t)))

    (add-to-list 'mu4e-bookmarks
                 (make-mu4e-bookmark
                  :name "All Inboxes"
                  :query "maildir:/mail/inbox OR maildir:/inbox/inbox OR maildir:/lorentzlaan/inbox"
                  :key ?i))

    ;; don't keep message buffers around
    (setq message-kill-buffer-on-exit t)

    (setq mb/mu4e-inbox-query
          "(maildir:/mail/inbox OR maildir:/inbox/inbox OR maildir:/lorentzlaan/inbox) AND flag:unread")

    (defun mb/go-to-inbox ()
      (interactive)
      (mu4e-headers-search mb/mu4e-inbox-query))

    ;; Start mu4e in the background so that it syncs mail periodically
    (mu4e t))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24722 58653 967064 501000) :init (24722 58653 967061 616000) :init-secs (0 0 25 488000) :use-package-secs (0 0 4975 86000)))

Use [[https://github.com/iqbalansari/mu4e-alert][mu4e-alert]] to show notifications when e-mail comes in:

#+begin_src emacs-lisp

  (use-package mu4e-alert
    :after mu4e
    :config
    ;; Show unread emails from all inboxes
    (setq mu4e-alert-interesting-mail-query mb/mu4e-inbox-query)

    ;; Show notifications for mails already notified
    (setq mu4e-alert-notify-repeated-mails nil)

    (mu4e-alert-enable-notifications))
#+end_src

